[{"title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}, {"title": "Mars 2020 Stands on Its Own Six Wheels", "preview": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"title": "NASA Invites Students to Name Mars 2020 Rover", "preview": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"title": "NASA's Perseverance Mars Rover Gets Its Wheels and Air Brakes", "preview": "After the rover was shipped from JPL to Kennedy Space Center, the team is getting closer to finalizing the spacecraft for launch later this summer."}, {"title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors", "preview": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."}, {"title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover", "preview": "SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."}, {"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"title": "Mars InSight Lander to Push on Top of the 'Mole'", "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."}]